## Production: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 1 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                          NAME                                          |
|----------|----------------------------------------------------------------------------------------|
| add      | `aws_route53_record.ai_answers_certificate_validation[&quot;*.ai-answers.alpha.canada.ca&quot;]` |
|          | `aws_route53_record.ai_answers_certificate_validation[&quot;reponses-ia.alpha.canada.ca&quot;]`  |
| update   | `aws_lb_listener.ai_answers_listener`                                                  |
| recreate | `aws_acm_certificate.ai_answers`                                                       |
|          | `aws_acm_certificate_validation.ai_answers`                                            |
|          | `aws_route53_record.ai_answers_certificate_validation[&quot;ai-answers.alpha.canada.ca&quot;]`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.ai_answers must be replaced
+/- resource "aws_acm_certificate" "ai_answers" {
      ~ arn                       = "arn:aws:acm:ca-central-1:730335533085:certificate/22e3835d-922c-4687-8d46-ada43d2e8ca8" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "ai-answers.alpha.canada.ca"
              - resource_record_name  = "_5707bb93bbcbb5aed0be674ebaa71764.ai-answers.alpha.canada.ca."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_5311683aec2b649de50998c8727cff32.xlfgrmvvlj.acm-validations.aws."
            },
          + {
              + domain_name           = "*.ai-answers.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "ai-answers.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "reponses-ia.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:ca-central-1:730335533085:certificate/22e3835d-922c-4687-8d46-ada43d2e8ca8" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2026-08-12T23:59:59Z" -> (known after apply)
      ~ not_before                = "2025-07-14T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "*.ai-answers.alpha.canada.ca",
          + "reponses-ia.alpha.canada.ca",
            # (1 unchanged element hidden)
        ]
      ~ tags                      = {
            "CostCentre"  = "ai-answers-prod"
          + "force_apply" = "2025-08-13"
        }
      ~ tags_all                  = {
          + "force_apply" = "2025-08-13"
            # (2 unchanged elements hidden)
        }
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ options (known after apply)
      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.ai_answers must be replaced
-/+ resource "aws_acm_certificate_validation" "ai_answers" {
      ~ certificate_arn         = "arn:aws:acm:ca-central-1:730335533085:certificate/22e3835d-922c-4687-8d46-ada43d2e8ca8" -> (known after apply) # forces replacement
      ~ id                      = "2025-07-14 18:28:18.121 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_5707bb93bbcbb5aed0be674ebaa71764.ai-answers.alpha.canada.ca",
        ] -> (known after apply) # forces replacement
    }

  # aws_lb_listener.ai_answers_listener will be updated in-place
  ~ resource "aws_lb_listener" "ai_answers_listener" {
      ~ certificate_arn                                                       = "arn:aws:acm:ca-central-1:730335533085:certificate/22e3835d-922c-4687-8d46-ada43d2e8ca8" -> (known after apply)
        id                                                                    = "arn:aws:elasticloadbalancing:ca-central-1:730335533085:listener/app/ai-answers-lb/45a1a79ce3ad38fd/9f727c16e83dbaef"
        tags                                                                  = {}
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_route53_record.ai_answers_certificate_validation["*.ai-answers.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "ai_answers_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z03953002E573M7I51UTU"
    }

  # aws_route53_record.ai_answers_certificate_validation["ai-answers.alpha.canada.ca"] must be replaced
-/+ resource "aws_route53_record" "ai_answers_certificate_validation" {
      ~ fqdn                             = "_5707bb93bbcbb5aed0be674ebaa71764.ai-answers.alpha.canada.ca" -> (known after apply)
      ~ id                               = "Z03953002E573M7I51UTU__5707bb93bbcbb5aed0be674ebaa71764.ai-answers.alpha.canada.ca._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_5707bb93bbcbb5aed0be674ebaa71764.ai-answers.alpha.canada.ca" -> (known after apply) # forces replacement
      ~ records                          = [
          - "_5311683aec2b649de50998c8727cff32.xlfgrmvvlj.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.ai_answers_certificate_validation["reponses-ia.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "ai_answers_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z03953002E573M7I51UTU"
    }

Plan: 5 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  ~ lb_listener                 = {
      ~ certificate_arn                                                       = "arn:aws:acm:ca-central-1:730335533085:certificate/22e3835d-922c-4687-8d46-ada43d2e8ca8" -> (known after apply)
        id                                                                    = "arn:aws:elasticloadbalancing:ca-central-1:730335533085:listener/app/ai-answers-lb/45a1a79ce3ad38fd/9f727c16e83dbaef"
        tags                                                                  = {}
        # (30 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.ai_answers_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener_rule.https_reponses[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ai_answers_load_balancer_sg"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
